Repository: SiroDevs/SonglibApp
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Login
sw: Ingia

# justFillLoginForm
source: Just fill in some text. There is no validator for the login
sw: Jaza tu na maneno. Hamna kichunguzi

source: Email
sw: Barua Pepe

source: Password
sw: Nenosiri

# todoTitle
source: Todos
sw: Mawazo

# settingsTitle
source: Settings
sw: Mipangilio

# animationsTitle
source: Animations
sw: Vihuishaji

source: Slow animations
sw: Vihuishaji vya Taratibu

source: Select Platform
sw: Chagua Jukwaa

# currentPlatform
source: Current platfrom: {platform}
sw: Jukwaa la Sasa: {platform}

source: Select Language
sw: Chagua Lugha

# currentLanguage
source: Current language: {language}
sw: Lugha ya Sasa: {language}

source: Select Theme
sw: Chagua Mandhari

# currentTheme
source: Current theme: {theme}
sw: Mandhari ya Sasa: {theme}

# licencesTitle
source: Licences
sw: Leseni

source: View Licences
sw: Angalia Leseni

source: System Default
sw: Chaguomsingi

# darkLabel
source: Dark
sw: Giza

# lightLabel
source: Light
sw: Angavu

# languageTitle
source: Language
sw: Lugha

# themeTitle
source: Theme
sw: Mandhari

# databaseTitle
source: Database
sw: Hifadhidata

source: View Database
sw: Angalia Hifadhidata

# errorBadRequest
source: Bad request error
sw: Hitilafu mbaya ya ombi

# errorDuringDev
source: You coded something wrong
sw: Umeandika kitu vibaya

# errorForbidden
source: Forbidden error
sw: Hitilafu iliyokatazwa

# errorGeneral
source: Something went wrong
sw: Hitilafu fulani imetokea

# errorGeneralWithCode
source: Something went wrong (code: {code})
sw: Hitilafu fulani imetokea (msimbo: {code})

# errorInternalServer
source: Internal server error
sw: Hitilafu ya seva ya ndani

# errorNoNetwork
source: No internet connection available
sw: Hakuna muunganisho wa intaneti unaopatikana

# errorUnauthorized
source: Unauthorized error
sw: Hitilafu isiyoidhinishwa

# cancelLabel
source: Cancel
sw: Ghairi

# deleteLabel
source: Delete
sw: Futa

# noLabel
source: No
sw: La

# okLabel
source: Ok
sw: Sawa

# saveLabel
source: Save
sw: Hifadhi

# yesLabel
source: Yes
sw: Ndio

# todoAddInputHint
source: Enter your Todo
sw: Weka wazo lako

# todoAddTitle
source: Add todo
sw: Ongeza wazo

# todoEmptyState
source: No data added to your database. Fetch some todos with an api call (download icon) or add one yourself by clicking the add icon.
sw: Hakuna data iliyoongezwa kwenye hifadhidata yako. Pata baadhi ya mawazo kwa mwito wa api (ikoni ya kupakua) au ongeza moja mwenyewe kwa kubofya ikoni ya kuongeza.
